# ###################### 列表在函数内部不能使用 + ，但是可以直接append ###################
a = [1,2,3]
def fun():
    a = a + [4]
# fun()
print(a)

# ######################################## 写成一行的风险 ################################
a, b = 1, 3 if False else (2, 4)  # 奇葩
print(a, b)  # 1 (2, 4)，这样写相当于a无条件赋值，条件用于判断对b是复制为3还是(2,4)
(a, b) = (1, 3) if False else (2, 4)
print(a, b)  # 2 4

# 如果为了处理边界对列表进行了扩充，那么在遍历的时候同样要注意边界
# range、切片都是取不到右边界的

# 广度优先搜索用队列，注意popleft
# 深度优先搜索一般用到全局变量

a = 0
def ddd():  # 变量的搜索
    b = a+1
    return b
print(ddd())

a = []
a.append(None)
print(a, len(a))



